; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob36) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 pallet12 pallet13 pallet14 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 crate13 crate14 crate15 crate16 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate12)
	(at pallet1 depot1)
	(clear crate6)
	(at pallet2 depot2)
	(clear crate8)
	(at pallet3 distributor0)
	(clear crate16)
	(at pallet4 distributor1)
	(clear crate10)
	(at pallet5 distributor2)
	(clear crate11)
	(at pallet6 distributor2)
	(clear pallet6)
	(at pallet7 distributor1)
	(clear pallet7)
	(at pallet8 depot0)
	(clear crate9)
	(at pallet9 distributor0)
	(clear pallet9)
	(at pallet10 distributor0)
	(clear crate15)
	(at pallet11 distributor0)
	(clear crate5)
	(at pallet12 depot0)
	(clear pallet12)
	(at pallet13 depot1)
	(clear pallet13)
	(at pallet14 distributor0)
	(clear crate13)
	(at truck0 depot2)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 296)
	(at truck1 distributor1)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 319)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor0)
	(available hoist6)
	(at hoist7 distributor0)
	(available hoist7)
	(at hoist8 depot2)
	(available hoist8)
	(at crate0 depot0)
	(on crate0 pallet0)
	(= (weight crate0) 50)
	(at crate1 distributor2)
	(on crate1 pallet5)
	(= (weight crate1) 62)
	(at crate2 depot0)
	(on crate2 crate0)
	(= (weight crate2) 25)
	(at crate3 depot0)
	(on crate3 crate2)
	(= (weight crate3) 45)
	(at crate4 distributor0)
	(on crate4 pallet11)
	(= (weight crate4) 80)
	(at crate5 distributor0)
	(on crate5 crate4)
	(= (weight crate5) 58)
	(at crate6 depot1)
	(on crate6 pallet1)
	(= (weight crate6) 29)
	(at crate7 depot0)
	(on crate7 crate3)
	(= (weight crate7) 19)
	(at crate8 depot2)
	(on crate8 pallet2)
	(= (weight crate8) 31)
	(at crate9 depot0)
	(on crate9 pallet8)
	(= (weight crate9) 37)
	(at crate10 distributor1)
	(on crate10 pallet4)
	(= (weight crate10) 60)
	(at crate11 distributor2)
	(on crate11 crate1)
	(= (weight crate11) 44)
	(at crate12 depot0)
	(on crate12 crate7)
	(= (weight crate12) 35)
	(at crate13 distributor0)
	(on crate13 pallet14)
	(= (weight crate13) 1)
	(at crate14 distributor0)
	(on crate14 pallet3)
	(= (weight crate14) 20)
	(at crate15 distributor0)
	(on crate15 pallet10)
	(= (weight crate15) 60)
	(at crate16 distributor0)
	(on crate16 crate14)
	(= (weight crate16) 26)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 pallet7)
		(on crate2 pallet14)
		(on crate3 crate0)
		(on crate4 pallet1)
		(on crate6 pallet9)
		(on crate7 pallet2)
		(on crate8 pallet0)
		(on crate9 crate3)
		(on crate10 pallet13)
		(on crate11 pallet6)
		(on crate12 pallet3)
		(on crate13 pallet8)
		(on crate15 crate8)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist6 crate13 pallet14 distributor0)
   deleted: (at crate13 distributor0) (clear crate13) (available hoist6) (on crate13 pallet14)
   added: (lifting hoist6 crate13) (clear pallet14)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 13
2. (lift hoist5 crate11 crate1 distributor2)
   deleted: (at crate11 distributor2) (clear crate11) (available hoist5) (on crate11 crate1)
   added: (lifting hoist5 crate11) (clear crate1)
   changed: (fuel-cost) from 1 to 2
   goals met: 0 of 13
3. (lift hoist7 crate16 crate14 distributor0)
   deleted: (at crate16 distributor0) (clear crate16) (available hoist7) (on crate16 crate14)
   added: (lifting hoist7 crate16) (clear crate14)
   changed: (fuel-cost) from 2 to 3
   goals met: 0 of 13
4. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 3 to 13
   goals met: 0 of 13
5. (drive truck0 depot2 depot1)
   deleted: (at truck0 depot2)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 13 to 23
   goals met: 0 of 13
6. (drop hoist5 crate11 pallet6 distributor2)
   deleted: (lifting hoist5 crate11) (clear pallet6)
   added: (available hoist5) (at crate11 distributor2) (clear crate11) (on crate11 pallet6)
   goals met: 1 of 13
7. (load hoist7 crate16 truck1 distributor0)
   deleted: (lifting hoist7 crate16)
   added: (in crate16 truck1) (available hoist7)
   changed: (current_load truck1) from 0 to 26
   goals met: 1 of 13
8. (lift hoist8 crate8 pallet2 depot2)
   deleted: (at crate8 depot2) (clear crate8) (available hoist8) (on crate8 pallet2)
   added: (lifting hoist8 crate8) (clear pallet2)
   changed: (fuel-cost) from 23 to 24
   goals met: 1 of 13
9. (lift hoist7 crate15 pallet10 distributor0)
   deleted: (at crate15 distributor0) (clear crate15) (available hoist7) (on crate15 pallet10)
   added: (lifting hoist7 crate15) (clear pallet10)
   changed: (fuel-cost) from 24 to 25
   goals met: 1 of 13
10. (lift hoist3 crate14 pallet3 distributor0)
   deleted: (at crate14 distributor0) (clear crate14) (available hoist3) (on crate14 pallet3)
   added: (lifting hoist3 crate14) (clear pallet3)
   changed: (fuel-cost) from 25 to 26
   goals met: 1 of 13
11. (load hoist3 crate14 truck1 distributor0)
   deleted: (lifting hoist3 crate14)
   added: (in crate14 truck1) (available hoist3)
   changed: (current_load truck1) from 26 to 46
   goals met: 1 of 13
12. (drop hoist8 crate8 pallet2 depot2)
   deleted: (lifting hoist8 crate8) (clear pallet2)
   added: (available hoist8) (at crate8 depot2) (clear crate8) (on crate8 pallet2)
   goals met: 1 of 13
13. (load hoist6 crate13 truck1 distributor0)
   deleted: (lifting hoist6 crate13)
   added: (in crate13 truck1) (available hoist6)
   changed: (current_load truck1) from 46 to 47
   goals met: 1 of 13
14. (load hoist7 crate15 truck1 distributor0)
   deleted: (lifting hoist7 crate15)
   added: (in crate15 truck1) (available hoist7)
   changed: (current_load truck1) from 47 to 107
   goals met: 1 of 13
15. (lift hoist1 crate6 pallet1 depot1)
   deleted: (at crate6 depot1) (clear crate6) (available hoist1) (on crate6 pallet1)
   added: (lifting hoist1 crate6) (clear pallet1)
   changed: (fuel-cost) from 26 to 27
   goals met: 1 of 13
16. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 27 to 37
   goals met: 1 of 13
17. (lift hoist8 crate8 pallet2 depot2)
   deleted: (at crate8 depot2) (clear crate8) (available hoist8) (on crate8 pallet2)
   added: (lifting hoist8 crate8) (clear pallet2)
   changed: (fuel-cost) from 37 to 38
   goals met: 1 of 13
18. (drive truck1 distributor0 depot2)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot2)
   changed: (fuel-cost) from 38 to 48
   goals met: 1 of 13
19. (unload hoist2 crate15 truck1 depot2)
   deleted: (in crate15 truck1) (available hoist2)
   added: (lifting hoist2 crate15)
   changed: (current_load truck1) from 107 to 47
   goals met: 1 of 13
20. (lift hoist0 crate9 pallet8 depot0)
   deleted: (at crate9 depot0) (clear crate9) (available hoist0) (on crate9 pallet8)
   added: (lifting hoist0 crate9) (clear pallet8)
   changed: (fuel-cost) from 48 to 49
   goals met: 1 of 13
21. (drive truck1 depot2 distributor0)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 49 to 59
   goals met: 1 of 13
22. (lift hoist3 crate5 crate4 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist3) (on crate5 crate4)
   added: (lifting hoist3 crate5) (clear crate4)
   changed: (fuel-cost) from 59 to 60
   goals met: 1 of 13
23. (drop hoist8 crate8 pallet2 depot2)
   deleted: (lifting hoist8 crate8) (clear pallet2)
   added: (available hoist8) (at crate8 depot2) (clear crate8) (on crate8 pallet2)
   goals met: 1 of 13
24. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 60 to 70
   goals met: 1 of 13
25. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 70 to 80
   goals met: 1 of 13
26. (drive truck1 depot0 depot1)
   deleted: (at truck1 depot0)
   added: (at truck1 depot1)
   changed: (fuel-cost) from 80 to 90
   goals met: 1 of 13
27. (load hoist1 crate6 truck1 depot1)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck1) (available hoist1)
   changed: (current_load truck1) from 47 to 76
   goals met: 1 of 13
28. (drop hoist0 crate9 pallet12 depot0)
   deleted: (lifting hoist0 crate9) (clear pallet12)
   added: (available hoist0) (at crate9 depot0) (clear crate9) (on crate9 pallet12)
   goals met: 1 of 13
29. (drive truck1 depot1 distributor0)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 90 to 100
   goals met: 1 of 13
30. (lift hoist6 crate4 pallet11 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist6) (on crate4 pallet11)
   added: (lifting hoist6 crate4) (clear pallet11)
   changed: (fuel-cost) from 100 to 101
   goals met: 1 of 13
31. (load hoist6 crate4 truck1 distributor0)
   deleted: (lifting hoist6 crate4)
   added: (in crate4 truck1) (available hoist6)
   changed: (current_load truck1) from 76 to 156
   goals met: 1 of 13
32. (drop hoist2 crate15 crate8 depot2)
   deleted: (lifting hoist2 crate15) (clear crate8)
   added: (available hoist2) (at crate15 depot2) (clear crate15) (on crate15 crate8)
   goals met: 2 of 13
33. (lift hoist8 crate15 crate8 depot2)
   deleted: (at crate15 depot2) (clear crate15) (available hoist8) (on crate15 crate8)
   added: (lifting hoist8 crate15) (clear crate8)
   changed: (fuel-cost) from 101 to 102
   goals met: 1 of 13
34. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 102 to 112
   goals met: 1 of 13
35. (lift hoist0 crate12 crate7 depot0)
   deleted: (at crate12 depot0) (clear crate12) (available hoist0) (on crate12 crate7)
   added: (lifting hoist0 crate12) (clear crate7)
   changed: (fuel-cost) from 112 to 113
   goals met: 1 of 13
36. (load hoist0 crate12 truck1 depot0)
   deleted: (lifting hoist0 crate12)
   added: (in crate12 truck1) (available hoist0)
   changed: (current_load truck1) from 156 to 191
   goals met: 1 of 13
37. (lift hoist0 crate7 crate3 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist0) (on crate7 crate3)
   added: (lifting hoist0 crate7) (clear crate3)
   changed: (fuel-cost) from 113 to 114
   goals met: 1 of 13
38. (load hoist0 crate7 truck1 depot0)
   deleted: (lifting hoist0 crate7)
   added: (in crate7 truck1) (available hoist0)
   changed: (current_load truck1) from 191 to 210
   goals met: 1 of 13
39. (lift hoist2 crate8 pallet2 depot2)
   deleted: (at crate8 depot2) (clear crate8) (available hoist2) (on crate8 pallet2)
   added: (lifting hoist2 crate8) (clear pallet2)
   changed: (fuel-cost) from 114 to 115
   goals met: 1 of 13
40. (lift hoist4 crate10 pallet4 distributor1)
   deleted: (at crate10 distributor1) (clear crate10) (available hoist4) (on crate10 pallet4)
   added: (lifting hoist4 crate10) (clear pallet4)
   changed: (fuel-cost) from 115 to 116
   goals met: 1 of 13
41. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 116 to 126
   goals met: 1 of 13
42. (unload hoist7 crate12 truck1 distributor0)
   deleted: (in crate12 truck1) (available hoist7)
   added: (lifting hoist7 crate12)
   changed: (current_load truck1) from 210 to 175
   goals met: 1 of 13
43. (drop hoist7 crate12 pallet3 distributor0)
   deleted: (lifting hoist7 crate12) (clear pallet3)
   added: (available hoist7) (at crate12 distributor0) (clear crate12) (on crate12 pallet3)
   goals met: 2 of 13
44. (lift hoist0 crate9 pallet12 depot0)
   deleted: (at crate9 depot0) (clear crate9) (available hoist0) (on crate9 pallet12)
   added: (lifting hoist0 crate9) (clear pallet12)
   changed: (fuel-cost) from 126 to 127
   goals met: 2 of 13
45. (unload hoist7 crate6 truck1 distributor0)
   deleted: (in crate6 truck1) (available hoist7)
   added: (lifting hoist7 crate6)
   changed: (current_load truck1) from 175 to 146
   goals met: 2 of 13
46. (drop hoist7 crate6 pallet9 distributor0)
   deleted: (lifting hoist7 crate6) (clear pallet9)
   added: (available hoist7) (at crate6 distributor0) (clear crate6) (on crate6 pallet9)
   goals met: 3 of 13
47. (drop hoist0 crate9 crate3 depot0)
   deleted: (lifting hoist0 crate9) (clear crate3)
   added: (available hoist0) (at crate9 depot0) (clear crate9) (on crate9 crate3)
   goals met: 4 of 13
48. (drop hoist2 crate8 pallet2 depot2)
   deleted: (lifting hoist2 crate8) (clear pallet2)
   added: (available hoist2) (at crate8 depot2) (clear crate8) (on crate8 pallet2)
   goals met: 4 of 13
49. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 127 to 137
   goals met: 4 of 13
50. (load hoist4 crate10 truck1 distributor1)
   deleted: (lifting hoist4 crate10)
   added: (in crate10 truck1) (available hoist4)
   changed: (current_load truck1) from 146 to 206
   goals met: 4 of 13
51. (drop hoist8 crate15 crate8 depot2)
   deleted: (lifting hoist8 crate15) (clear crate8)
   added: (available hoist8) (at crate15 depot2) (clear crate15) (on crate15 crate8)
   goals met: 5 of 13
52. (drive truck1 distributor1 depot1)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot1)
   changed: (fuel-cost) from 137 to 147
   goals met: 5 of 13
53. (unload hoist1 crate4 truck1 depot1)
   deleted: (in crate4 truck1) (available hoist1)
   added: (lifting hoist1 crate4)
   changed: (current_load truck1) from 206 to 126
   goals met: 5 of 13
54. (drive truck1 depot1 distributor0)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 147 to 157
   goals met: 5 of 13
55. (drop hoist1 crate4 pallet1 depot1)
   deleted: (lifting hoist1 crate4) (clear pallet1)
   added: (available hoist1) (at crate4 depot1) (clear crate4) (on crate4 pallet1)
   goals met: 6 of 13
56. (lift hoist8 crate15 crate8 depot2)
   deleted: (at crate15 depot2) (clear crate15) (available hoist8) (on crate15 crate8)
   added: (lifting hoist8 crate15) (clear crate8)
   changed: (fuel-cost) from 157 to 158
   goals met: 5 of 13
57. (drive truck1 distributor0 depot1)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot1)
   changed: (fuel-cost) from 158 to 168
   goals met: 5 of 13
58. (unload hoist1 crate10 truck1 depot1)
   deleted: (in crate10 truck1) (available hoist1)
   added: (lifting hoist1 crate10)
   changed: (current_load truck1) from 126 to 66
   goals met: 5 of 13
59. (drop hoist1 crate10 pallet13 depot1)
   deleted: (lifting hoist1 crate10) (clear pallet13)
   added: (available hoist1) (at crate10 depot1) (clear crate10) (on crate10 pallet13)
   goals met: 6 of 13
60. (lift hoist2 crate8 pallet2 depot2)
   deleted: (at crate8 depot2) (clear crate8) (available hoist2) (on crate8 pallet2)
   added: (lifting hoist2 crate8) (clear pallet2)
   changed: (fuel-cost) from 168 to 169
   goals met: 6 of 13
61. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 169 to 179
   goals met: 6 of 13
62. (unload hoist0 crate13 truck1 depot0)
   deleted: (in crate13 truck1) (available hoist0)
   added: (lifting hoist0 crate13)
   changed: (current_load truck1) from 66 to 65
   goals met: 6 of 13
63. (drop hoist0 crate13 pallet8 depot0)
   deleted: (lifting hoist0 crate13) (clear pallet8)
   added: (available hoist0) (at crate13 depot0) (clear crate13) (on crate13 pallet8)
   goals met: 7 of 13
64. (drop hoist3 crate5 pallet11 distributor0)
   deleted: (lifting hoist3 crate5) (clear pallet11)
   added: (available hoist3) (at crate5 distributor0) (clear crate5) (on crate5 pallet11)
   goals met: 7 of 13
65. (drop hoist2 crate8 pallet2 depot2)
   deleted: (lifting hoist2 crate8) (clear pallet2)
   added: (available hoist2) (at crate8 depot2) (clear crate8) (on crate8 pallet2)
   goals met: 7 of 13
66. (lift hoist0 crate9 crate3 depot0)
   deleted: (at crate9 depot0) (clear crate9) (available hoist0) (on crate9 crate3)
   added: (lifting hoist0 crate9) (clear crate3)
   changed: (fuel-cost) from 179 to 180
   goals met: 6 of 13
67. (drop hoist0 crate9 crate13 depot0)
   deleted: (lifting hoist0 crate9) (clear crate13)
   added: (available hoist0) (at crate9 depot0) (clear crate9) (on crate9 crate13)
   goals met: 6 of 13
68. (lift hoist0 crate3 crate2 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 crate2)
   added: (lifting hoist0 crate3) (clear crate2)
   changed: (fuel-cost) from 180 to 181
   goals met: 6 of 13
69. (drop hoist0 crate3 crate9 depot0)
   deleted: (lifting hoist0 crate3) (clear crate9)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 crate9)
   goals met: 6 of 13
70. (lift hoist0 crate2 crate0 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist0) (on crate2 crate0)
   added: (lifting hoist0 crate2) (clear crate0)
   changed: (fuel-cost) from 181 to 182
   goals met: 6 of 13
71. (load hoist0 crate2 truck1 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck1) (available hoist0)
   changed: (current_load truck1) from 65 to 90
   goals met: 6 of 13
72. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 182 to 192
   goals met: 6 of 13
73. (unload hoist7 crate2 truck1 distributor0)
   deleted: (in crate2 truck1) (available hoist7)
   added: (lifting hoist7 crate2)
   changed: (current_load truck1) from 90 to 65
   goals met: 6 of 13
74. (drop hoist7 crate2 pallet14 distributor0)
   deleted: (lifting hoist7 crate2) (clear pallet14)
   added: (available hoist7) (at crate2 distributor0) (clear crate2) (on crate2 pallet14)
   goals met: 7 of 13
75. (drive truck1 distributor0 depot2)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot2)
   changed: (fuel-cost) from 192 to 202
   goals met: 7 of 13
76. (lift hoist0 crate3 crate9 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 crate9)
   added: (lifting hoist0 crate3) (clear crate9)
   changed: (fuel-cost) from 202 to 203
   goals met: 7 of 13
77. (drop hoist0 crate3 crate0 depot0)
   deleted: (lifting hoist0 crate3) (clear crate0)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 crate0)
   goals met: 8 of 13
78. (lift hoist0 crate9 crate13 depot0)
   deleted: (at crate9 depot0) (clear crate9) (available hoist0) (on crate9 crate13)
   added: (lifting hoist0 crate9) (clear crate13)
   changed: (fuel-cost) from 203 to 204
   goals met: 8 of 13
79. (drop hoist0 crate9 crate3 depot0)
   deleted: (lifting hoist0 crate9) (clear crate3)
   added: (available hoist0) (at crate9 depot0) (clear crate9) (on crate9 crate3)
   goals met: 9 of 13
80. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 204 to 214
   goals met: 9 of 13
81. (lift hoist2 crate8 pallet2 depot2)
   deleted: (at crate8 depot2) (clear crate8) (available hoist2) (on crate8 pallet2)
   added: (lifting hoist2 crate8) (clear pallet2)
   changed: (fuel-cost) from 214 to 215
   goals met: 9 of 13
82. (load hoist8 crate15 truck1 depot2)
   deleted: (lifting hoist8 crate15)
   added: (in crate15 truck1) (available hoist8)
   changed: (current_load truck1) from 65 to 125
   goals met: 9 of 13
83. (unload hoist8 crate7 truck1 depot2)
   deleted: (in crate7 truck1) (available hoist8)
   added: (lifting hoist8 crate7)
   changed: (current_load truck1) from 125 to 106
   goals met: 9 of 13
84. (drop hoist8 crate7 pallet2 depot2)
   deleted: (lifting hoist8 crate7) (clear pallet2)
   added: (available hoist8) (at crate7 depot2) (clear crate7) (on crate7 pallet2)
   goals met: 10 of 13
85. (load hoist2 crate8 truck1 depot2)
   deleted: (lifting hoist2 crate8)
   added: (in crate8 truck1) (available hoist2)
   changed: (current_load truck1) from 106 to 137
   goals met: 10 of 13
86. (drive truck1 depot2 depot0)
   deleted: (at truck1 depot2)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 215 to 225
   goals met: 10 of 13
87. (unload hoist0 crate8 truck1 depot0)
   deleted: (in crate8 truck1) (available hoist0)
   added: (lifting hoist0 crate8)
   changed: (current_load truck1) from 137 to 106
   goals met: 10 of 13
88. (drop hoist0 crate8 pallet12 depot0)
   deleted: (lifting hoist0 crate8) (clear pallet12)
   added: (available hoist0) (at crate8 depot0) (clear crate8) (on crate8 pallet12)
   goals met: 10 of 13
89. (unload hoist0 crate15 truck1 depot0)
   deleted: (in crate15 truck1) (available hoist0)
   added: (lifting hoist0 crate15)
   changed: (current_load truck1) from 106 to 46
   goals met: 10 of 13
90. (drop hoist0 crate15 crate8 depot0)
   deleted: (lifting hoist0 crate15) (clear crate8)
   added: (available hoist0) (at crate15 depot0) (clear crate15) (on crate15 crate8)
   goals met: 11 of 13
91. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 225 to 235
   goals met: 11 of 13
92. (lift hoist0 crate9 crate3 depot0)
   deleted: (at crate9 depot0) (clear crate9) (available hoist0) (on crate9 crate3)
   added: (lifting hoist0 crate9) (clear crate3)
   changed: (fuel-cost) from 235 to 236
   goals met: 10 of 13
93. (drop hoist0 crate9 crate15 depot0)
   deleted: (lifting hoist0 crate9) (clear crate15)
   added: (available hoist0) (at crate9 depot0) (clear crate9) (on crate9 crate15)
   goals met: 10 of 13
94. (lift hoist0 crate3 crate0 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 crate0)
   added: (lifting hoist0 crate3) (clear crate0)
   changed: (fuel-cost) from 236 to 237
   goals met: 9 of 13
95. (drop hoist0 crate3 crate13 depot0)
   deleted: (lifting hoist0 crate3) (clear crate13)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 crate13)
   goals met: 9 of 13
96. (lift hoist0 crate9 crate15 depot0)
   deleted: (at crate9 depot0) (clear crate9) (available hoist0) (on crate9 crate15)
   added: (lifting hoist0 crate9) (clear crate15)
   changed: (fuel-cost) from 237 to 238
   goals met: 9 of 13
97. (drop hoist0 crate9 crate3 depot0)
   deleted: (lifting hoist0 crate9) (clear crate3)
   added: (available hoist0) (at crate9 depot0) (clear crate9) (on crate9 crate3)
   goals met: 10 of 13
98. (lift hoist0 crate0 pallet0 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 pallet0)
   added: (lifting hoist0 crate0) (clear pallet0)
   changed: (fuel-cost) from 238 to 239
   goals met: 10 of 13
99. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 239 to 249
   goals met: 10 of 13
100. (load hoist0 crate0 truck1 depot0)
   deleted: (lifting hoist0 crate0)
   added: (in crate0 truck1) (available hoist0)
   changed: (current_load truck1) from 46 to 96
   goals met: 10 of 13
101. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 249 to 259
   goals met: 10 of 13
102. (unload hoist4 crate0 truck1 distributor1)
   deleted: (in crate0 truck1) (available hoist4)
   added: (lifting hoist4 crate0)
   changed: (current_load truck1) from 96 to 46
   goals met: 10 of 13
103. (lift hoist0 crate9 crate3 depot0)
   deleted: (at crate9 depot0) (clear crate9) (available hoist0) (on crate9 crate3)
   added: (lifting hoist0 crate9) (clear crate3)
   changed: (fuel-cost) from 259 to 260
   goals met: 9 of 13
104. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 260 to 270
   goals met: 9 of 13
105. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 270 to 280
   goals met: 9 of 13
106. (load hoist0 crate9 truck1 depot0)
   deleted: (lifting hoist0 crate9)
   added: (in crate9 truck1) (available hoist0)
   changed: (current_load truck1) from 46 to 83
   goals met: 9 of 13
107. (drop hoist4 crate0 pallet7 distributor1)
   deleted: (lifting hoist4 crate0) (clear pallet7)
   added: (available hoist4) (at crate0 distributor1) (clear crate0) (on crate0 pallet7)
   goals met: 10 of 13
108. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 280 to 290
   goals met: 10 of 13
109. (lift hoist0 crate3 crate13 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 crate13)
   added: (lifting hoist0 crate3) (clear crate13)
   changed: (fuel-cost) from 290 to 291
   goals met: 10 of 13
110. (load hoist0 crate3 truck1 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck1) (available hoist0)
   changed: (current_load truck1) from 83 to 128
   goals met: 10 of 13
111. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 291 to 301
   goals met: 10 of 13
112. (unload hoist4 crate3 truck1 distributor1)
   deleted: (in crate3 truck1) (available hoist4)
   added: (lifting hoist4 crate3)
   changed: (current_load truck1) from 128 to 83
   goals met: 10 of 13
113. (drop hoist4 crate3 crate0 distributor1)
   deleted: (lifting hoist4 crate3) (clear crate0)
   added: (available hoist4) (at crate3 distributor1) (clear crate3) (on crate3 crate0)
   goals met: 11 of 13
114. (unload hoist4 crate9 truck1 distributor1)
   deleted: (in crate9 truck1) (available hoist4)
   added: (lifting hoist4 crate9)
   changed: (current_load truck1) from 83 to 46
   goals met: 11 of 13
115. (drop hoist4 crate9 crate3 distributor1)
   deleted: (lifting hoist4 crate9) (clear crate3)
   added: (available hoist4) (at crate9 distributor1) (clear crate9) (on crate9 crate3)
   goals met: 12 of 13
116. (lift hoist0 crate15 crate8 depot0)
   deleted: (at crate15 depot0) (clear crate15) (available hoist0) (on crate15 crate8)
   added: (lifting hoist0 crate15) (clear crate8)
   changed: (fuel-cost) from 301 to 302
   goals met: 11 of 13
117. (drop hoist0 crate15 crate13 depot0)
   deleted: (lifting hoist0 crate15) (clear crate13)
   added: (available hoist0) (at crate15 depot0) (clear crate15) (on crate15 crate13)
   goals met: 11 of 13
118. (lift hoist0 crate8 pallet12 depot0)
   deleted: (at crate8 depot0) (clear crate8) (available hoist0) (on crate8 pallet12)
   added: (lifting hoist0 crate8) (clear pallet12)
   changed: (fuel-cost) from 302 to 303
   goals met: 11 of 13
119. (drop hoist0 crate8 pallet0 depot0)
   deleted: (lifting hoist0 crate8) (clear pallet0)
   added: (available hoist0) (at crate8 depot0) (clear crate8) (on crate8 pallet0)
   goals met: 12 of 13
120. (lift hoist0 crate15 crate13 depot0)
   deleted: (at crate15 depot0) (clear crate15) (available hoist0) (on crate15 crate13)
   added: (lifting hoist0 crate15) (clear crate13)
   changed: (fuel-cost) from 303 to 304
   goals met: 12 of 13
121. (drop hoist0 crate15 crate8 depot0)
   deleted: (lifting hoist0 crate15) (clear crate8)
   added: (available hoist0) (at crate15 depot0) (clear crate15) (on crate15 crate8)
   goals met: 13 of 13
